Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وأدخل يدك في جيبك تخرج بيضاء من غير سوء في تسع آيات إلى فرعون وقومه إنهم كانوا قوما فاسقين
en: And put your hand into the opening of your garment [at the breast]; it will come out white without disease. [These are] among the nine signs [you will take] to Pharaoh and his people. Indeed, they have been a people defiantly disobedient."

source: فلما جاءتهم آياتنا مبصرة قالوا هذا سحر مبين
en: But when there came to them Our visible signs, they said, "This is obvious magic."

source: وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا فانظر كيف كان عاقبة المفسدين
en: And they rejected them, while their [inner] selves were convinced thereof, out of injustice and haughtiness. So see how was the end of the corrupters.

source: ولقد آتينا داوود وسليمان علما وقالا الحمد لله الذي فضلنا على كثير من عباده المؤمنين
en: And We had certainly given to David and Solomon knowledge, and they said, "Praise [is due] to Allah, who has favored us over many of His believing servants."

source: وورث سليمان داوود وقال يا أيها الناس علمنا منطق الطير وأوتينا من كل شيء إن هذا لهو الفضل المبين
en: And Solomon inherited David. He said, "O people, we have been taught the language of birds, and we have been given from all things. Indeed, this is evident bounty."

source: وحشر لسليمان جنوده من الجن والإنس والطير فهم يوزعون
en: And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows.

source: حتى إذا أتوا على واد النمل قالت نملة يا أيها النمل ادخلوا مساكنكم لا يحطمنكم سليمان وجنوده وهم لا يشعرون
en: Until, when they came upon the valley of the ants, an ant said, "O ants, enter your dwellings that you not be crushed by Solomon and his soldiers while they perceive not."

source: فتبسم ضاحكا من قولها وقال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأدخلني برحمتك في عبادك الصالحين
en: So [Solomon] smiled, amused at her speech, and said, "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants."

source: وتفقد الطير فقال ما لي لا أرى الهدهد أم كان من الغائبين
en: And he took attendance of the birds and said, "Why do I not see the hoopoe - or is he among the absent?

source: لأعذبنه عذابا شديدا أو لأذبحنه أو ليأتيني بسلطان مبين
en: I will surely punish him with a severe punishment or slaughter him unless he brings me clear authorization."

source: فمكث غير بعيد فقال أحطت بما لم تحط به وجئتك من سبإ بنبإ يقين
en: But the hoopoe stayed not long and said, "I have encompassed [in knowledge] that which you have not encompassed, and I have come to you from Sheba with certain news.

source: إني وجدت امرأة تملكهم وأوتيت من كل شيء ولها عرش عظيم
en: Indeed, I found [there] a woman ruling them, and she has been given of all things, and she has a great throne.

source: وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطان أعمالهم فصدهم عن السبيل فهم لا يهتدون
en: I found her and her people prostrating to the sun instead of Allah, and Satan has made their deeds pleasing to them and averted them from [His] way, so they are not guided,

source: ألا يسجدوا لله الذي يخرج الخبء في السماوات والأرض ويعلم ما تخفون وما تعلنون
en: [And] so they do not prostrate to Allah, who brings forth what is hidden within the heavens and the earth and knows what you conceal and what you declare -

source: الله لا إله إلا هو رب العرش العظيم
en: Allah - there is no deity except Him, Lord of the Great Throne."

source: قال سننظر أصدقت أم كنت من الكاذبين
en: [Solomon] said, "We will see whether you were truthful or were of the liars.

source: اذهب بكتابي هذا فألقه إليهم ثم تول عنهم فانظر ماذا يرجعون
en: Take this letter of mine and deliver it to them. Then leave them and see what [answer] they will return."

source: قالت يا أيها الملأ إني ألقي إلي كتاب كريم
en: She said, "O eminent ones, indeed, to me has been delivered a noble letter.

source: إنه من سليمان وإنه بسم الله الرحمن الرحيم
en: Indeed, it is from Solomon, and indeed, it reads: 'In the name of Allah, the Entirely Merciful, the Especially Merciful,

source: ألا تعلوا علي وأتوني مسلمين
en: Be not haughty with me but come to me in submission [as Muslims].' "

source: قالت يا أيها الملأ أفتوني في أمري ما كنت قاطعة أمرا حتى تشهدون
en: She said, "O eminent ones, advise me in my affair. I would not decide a matter until you witness [for] me."

source: قالوا نحن أولو قوة وأولو بأس شديد والأمر إليك فانظري ماذا تأمرين
en: They said, "We are men of strength and of great military might, but the command is yours, so see what you will command."

source: قالت إن الملوك إذا دخلوا قرية أفسدوها وجعلوا أعزة أهلها أذلة وكذلك يفعلون
en: She said, "Indeed kings - when they enter a city, they ruin it and render the honored of its people humbled. And thus do they do.

source: وإني مرسلة إليهم بهدية فناظرة بم يرجع المرسلون
en: But indeed, I will send to them a gift and see with what [reply] the messengers will return."

source: فلما جاء سليمان قال أتمدونن بمال فما آتاني الله خير مما آتاكم بل أنتم بهديتكم تفرحون
en: So when they came to Solomon, he said, "Do you provide me with wealth? But what Allah has given me is better than what He has given you. Rather, it is you who rejoice in your gift.

source: ارجع إليهم فلنأتينهم بجنود لا قبل لهم بها ولنخرجنهم منها أذلة وهم صاغرون
en: Return to them, for we will surely come to them with soldiers that they will be powerless to encounter, and we will surely expel them therefrom in humiliation, and they will be debased."

source: قال يا أيها الملأ أيكم يأتيني بعرشها قبل أن يأتوني مسلمين
en: [Solomon] said, "O assembly [of jinn], which of you will bring me her throne before they come to me in submission?"

source: قال عفريت من الجن أنا آتيك به قبل أن تقوم من مقامك وإني عليه لقوي أمين
en: A powerful one from among the jinn said, "I will bring it to you before you rise from your place, and indeed, I am for this [task] strong and trustworthy."

source: قال الذي عنده علم من الكتاب أنا آتيك به قبل أن يرتد إليك طرفك فلما رآه مستقرا عنده قال هذا من فضل ربي ليبلوني أأشكر أم أكفر ومن شكر فإنما يشكر لنفسه ومن كفر فإن ربي غني كريم
en: Said one who had knowledge from the Scripture, "I will bring it to you before your glance returns to you." And when [Solomon] saw it placed before him, he said, "This is from the favor of my Lord to test me whether I will be grateful or ungrateful. And whoever is grateful - his gratitude is only for [the benefit of] himself. And whoever is ungrateful - then indeed, my Lord is Free of need and Generous."

source: قال نكروا لها عرشها ننظر أتهتدي أم تكون من الذين لا يهتدون
en: He said, "Disguise for her her throne; we will see whether she will be guided [to truth] or will be of those who is not guided."

source: فلما جاءت قيل أهكذا عرشك قالت كأنه هو وأوتينا العلم من قبلها وكنا مسلمين
en: So when she arrived, it was said [to her], "Is your throne like this?" She said, "[It is] as though it was it." [Solomon said], "And we were given knowledge before her, and we have been Muslims [in submission to Allah].

source: وصدها ما كانت تعبد من دون الله إنها كانت من قوم كافرين
en: And that which she was worshipping other than Allah had averted her [from submission to Him]. Indeed, she was from a disbelieving people."

source: قيل لها ادخلي الصرح فلما رأته حسبته لجة وكشفت عن ساقيها قال إنه صرح ممرد من قوارير قالت رب إني ظلمت نفسي وأسلمت مع سليمان لله رب العالمين
en: She was told, "Enter the palace." But when she saw it, she thought it was a body of water and uncovered her shins [to wade through]. He said, "Indeed, it is a palace [whose floor is] made smooth with glass." She said, "My Lord, indeed I have wronged myself, and I submit with Solomon to Allah, Lord of the worlds."

source: ولقد أرسلنا إلى ثمود أخاهم صالحا أن اعبدوا الله فإذا هم فريقان يختصمون
en: And We had certainly sent to Thamud their brother Salih, [saying], "Worship Allah," and at once they were two parties conflicting.

source: قال يا قوم لم تستعجلون بالسيئة قبل الحسنة لولا تستغفرون الله لعلكم ترحمون
en: He said, "O my people, why are you impatient for evil instead of good? Why do you not seek forgiveness of Allah that you may receive mercy?"

source: قالوا اطيرنا بك وبمن معك قال طائركم عند الله بل أنتم قوم تفتنون
en: They said, "We consider you a bad omen, you and those with you." He said, "Your omen is with Allah. Rather, you are a people being tested."

source: وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون
en: And there were in the city nine family heads causing corruption in the land and not amending [its affairs].

source: قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون
en: They said, "Take a mutual oath by Allah that we will kill him by night, he and his family. Then we will say to his executor, 'We did not witness the destruction of his family, and indeed, we are truthful.' "

source: ومكروا مكرا ومكرنا مكرا وهم لا يشعرون
en: And they planned a plan, and We planned a plan, while they perceived not.

source: فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين
en: Then look how was the outcome of their plan - that We destroyed them and their people, all.

source: فتلك بيوتهم خاوية بما ظلموا إن في ذلك لآية لقوم يعلمون
en: So those are their houses, desolate because of the wrong they had done. Indeed in that is a sign for people who know.

source: وأنجينا الذين آمنوا وكانوا يتقون
en: And We saved those who believed and used to fear Allah.

source: ولوطا إذ قال لقومه أتأتون الفاحشة وأنتم تبصرون
en: And [mention] Lot, when he said to his people, "Do you commit immorality while you are seeing?

source: أئنكم لتأتون الرجال شهوة من دون النساء بل أنتم قوم تجهلون
en: Do you indeed approach men with desire instead of women? Rather, you are a people behaving ignorantly."

source: فما كان جواب قومه إلا أن قالوا أخرجوا آل لوط من قريتكم إنهم أناس يتطهرون
en: But the answer of his people was not except that they said, "Expel the family of Lot from your city. Indeed, they are people who keep themselves pure."

source: فأنجيناه وأهله إلا امرأته قدرناها من الغابرين
en: So We saved him and his family, except for his wife; We destined her to be of those who remained behind.

source: قل الحمد لله وسلام على عباده الذين اصطفى آلله خير أما يشركون
en: Say, [O Muhammad], "Praise be to Allah, and peace upon His servants whom He has chosen. Is Allah better or what they associate with Him?"

source: أمن خلق السماوات والأرض وأنزل لكم من السماء ماء فأنبتنا به حدائق ذات بهجة ما كان لكم أن تنبتوا شجرها أإله مع الله بل هم قوم يعدلون
en: [More precisely], is He [not best] who created the heavens and the earth and sent down for you rain from the sky, causing to grow thereby gardens of joyful beauty which you could not [otherwise] have grown the trees thereof? Is there a deity with Allah? [No], but they are a people who ascribe equals [to Him].

source: أمن جعل الأرض قرارا وجعل خلالها أنهارا وجعل لها رواسي وجعل بين البحرين حاجزا أإله مع الله بل أكثرهم لا يعلمون
en: Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allah? [No], but most of them do not know.

source: أمن يجيب المضطر إذا دعاه ويكشف السوء ويجعلكم خلفاء الأرض أإله مع الله قليلا ما تذكرون
en: Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth? Is there a deity with Allah? Little do you remember.

source: أمن يهديكم في ظلمات البر والبحر ومن يرسل الرياح بشرا بين يدي رحمته أإله مع الله تعالى الله عما يشركون
en: Is He [not best] who guides you through the darknesses of the land and sea and who sends the winds as good tidings before His mercy? Is there a deity with Allah? High is Allah above whatever they associate with Him.

source: أمن يبدأ الخلق ثم يعيده ومن يرزقكم من السماء والأرض أإله مع الله قل هاتوا برهانكم إن كنتم صادقين
en: Is He [not best] who begins creation and then repeats it and who provides for you from the heaven and earth? Is there a deity with Allah? Say, "Produce your proof, if you should be truthful."

source: قل لا يعلم من في السماوات والأرض الغيب إلا الله وما يشعرون أيان يبعثون
en: Say, "None in the heavens and earth knows the unseen except Allah, and they do not perceive when they will be resurrected."

source: بل ادارك علمهم في الآخرة بل هم في شك منها بل هم منها عمون
en: Rather, their knowledge is arrested concerning the Hereafter. Rather, they are in doubt about it. Rather, they are, concerning it, blind.

source: وقال الذين كفروا أإذا كنا ترابا وآباؤنا أئنا لمخرجون
en: And those who disbelieve say, "When we have become dust as well as our forefathers, will we indeed be brought out [of the graves]?

source: لقد وعدنا هذا نحن وآباؤنا من قبل إن هذا إلا أساطير الأولين
en: We have been promised this, we and our forefathers, before. This is not but legends of the former peoples."

source: قل سيروا في الأرض فانظروا كيف كان عاقبة المجرمين
en: Say, [O Muhammad], "Travel through the land and observe how was the end of the criminals."

source: ولا تحزن عليهم ولا تكن في ضيق مما يمكرون
en: And grieve not over them or be in distress from what they conspire.

source: قل عسى أن يكون ردف لكم بعض الذي تستعجلون
en: Say, "Perhaps it is close behind you - some of that for which you are impatient.

source: وإن ربك لذو فضل على الناس ولكن أكثرهم لا يشكرون
en: And indeed, your Lord is full of bounty for the people, but most of them do not show gratitude."

source: وإن ربك ليعلم ما تكن صدورهم وما يعلنون
en: And indeed, your Lord knows what their breasts conceal and what they declare.

source: وما من غائبة في السماء والأرض إلا في كتاب مبين
en: And there is nothing concealed within the heaven and the earth except that it is in a clear Register.

source: إن هذا القرآن يقص على بني إسرائيل أكثر الذي هم فيه يختلفون
en: Indeed, this Qur'an relates to the Children of Israel most of that over which they disagree.

source: وإنه لهدى ورحمة للمؤمنين
en: And indeed, it is guidance and mercy for the believers.

source: إن ربك يقضي بينهم بحكمه وهو العزيز العليم
en: Indeed, your Lord will judge between them by His [wise] judgement. And He is the Exalted in Might, the Knowing.

source: فتوكل على الله إنك على الحق المبين
en: So rely upon Allah; indeed, you are upon the clear truth.

source: إنك لا تسمع الموتى ولا تسمع الصم الدعاء إذا ولوا مدبرين
en: Indeed, you will not make the dead hear, nor will you make the deaf hear the call when they have turned their backs retreating.

source: وما أنت بهادي العمي عن ضلالتهم إن تسمع إلا من يؤمن بآياتنا فهم مسلمون
en: And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [submitting to Allah].

source: وإذا وقع القول عليهم أخرجنا لهم دابة من الأرض تكلمهم أن الناس كانوا بآياتنا لا يوقنون
en: And when the word befalls them, We will bring forth for them a creature from the earth speaking to them, [saying] that the people were, of Our verses, not certain [in faith].

source: ويوم نحشر من كل أمة فوجا ممن يكذب بآياتنا فهم يوزعون
en: And [warn of] the Day when We will gather from every nation a company of those who deny Our signs, and they will be [driven] in rows

source: حتى إذا جاءوا قال أكذبتم بآياتي ولم تحيطوا بها علما أماذا كنتم تعملون
en: Until, when they arrive [at the place of Judgement], He will say, "Did you deny My signs while you encompassed them not in knowledge, or what [was it that] you were doing?"

source: ووقع القول عليهم بما ظلموا فهم لا ينطقون
en: And the decree will befall them for the wrong they did, and they will not [be able to] speak.

source: ألم يروا أنا جعلنا الليل ليسكنوا فيه والنهار مبصرا إن في ذلك لآيات لقوم يؤمنون
en: Do they not see that We made the night that they may rest therein and the day giving sight? Indeed in that are signs for a people who believe.

source: ويوم ينفخ في الصور ففزع من في السماوات ومن في الأرض إلا من شاء الله وكل أتوه داخرين
en: And [warn of] the Day the Horn will be blown, and whoever is in the heavens and whoever is on the earth will be terrified except whom Allah wills. And all will come to Him humbled.

source: وترى الجبال تحسبها جامدة وهي تمر مر السحاب صنع الله الذي أتقن كل شيء إنه خبير بما تفعلون
en: And you see the mountains, thinking them rigid, while they will pass as the passing of clouds. [It is] the work of Allah, who perfected all things. Indeed, He is Acquainted with that which you do.

source: من جاء بالحسنة فله خير منها وهم من فزع يومئذ آمنون
en: Whoever comes [at Judgement] with a good deed will have better than it, and they, from the terror of that Day, will be safe.

source: ومن جاء بالسيئة فكبت وجوههم في النار هل تجزون إلا ما كنتم تعملون
en: And whoever comes with an evil deed - their faces will be overturned into the Fire, [and it will be said], "Are you recompensed except for what you used to do?"

source: إنما أمرت أن أعبد رب هذه البلدة الذي حرمها وله كل شيء وأمرت أن أكون من المسلمين
en: [Say, O Muhammad], "I have only been commanded to worship the Lord of this city, who made it sacred and to whom [belongs] all things. And I am commanded to be of the Muslims [those who submit to Allah]

source: وأن أتلو القرآن فمن اهتدى فإنما يهتدي لنفسه ومن ضل فقل إنما أنا من المنذرين
en: And to recite the Qur'an." And whoever is guided is only guided for [the benefit of] himself; and whoever strays - say, "I am only [one] of the warners."

source: وقل الحمد لله سيريكم آياته فتعرفونها وما ربك بغافل عما تعملون
en: And say, "[All] praise is [due] to Allah. He will show you His signs, and you will recognize them. And your Lord is not unaware of what you do."

source: نتلو عليك من نبإ موسى وفرعون بالحق لقوم يؤمنون
en: We recite to you from the news of Moses and Pharaoh in truth for a people who believe.

source: إن فرعون علا في الأرض وجعل أهلها شيعا يستضعف طائفة منهم يذبح أبناءهم ويستحيي نساءهم إنه كان من المفسدين
en: Indeed, Pharaoh exalted himself in the land and made its people into factions, oppressing a sector among them, slaughtering their [newborn] sons and keeping their females alive. Indeed, he was of the corrupters.

source: ونريد أن نمن على الذين استضعفوا في الأرض ونجعلهم أئمة ونجعلهم الوارثين
en: And We wanted to confer favor upon those who were oppressed in the land and make them leaders and make them inheritors

source: ونمكن لهم في الأرض ونري فرعون وهامان وجنودهما منهم ما كانوا يحذرون
en: And establish them in the land and show Pharaoh and [his minister] Haman and their soldiers through them that which they had feared.

source: وأوحينا إلى أم موسى أن أرضعيه فإذا خفت عليه فألقيه في اليم ولا تخافي ولا تحزني إنا رادوه إليك وجاعلوه من المرسلين
en: And We inspired to the mother of Moses, "Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers."

source: فالتقطه آل فرعون ليكون لهم عدوا وحزنا إن فرعون وهامان وجنودهما كانوا خاطئين
en: And the family of Pharaoh picked him up [out of the river] so that he would become to them an enemy and a [cause of] grief. Indeed, Pharaoh and Haman and their soldiers were deliberate sinners.

source: وقالت امرأت فرعون قرت عين لي ولك لا تقتلوه عسى أن ينفعنا أو نتخذه ولدا وهم لا يشعرون
en: And the wife of Pharaoh said, "[He will be] a comfort of the eye for me and for you. Do not kill him; perhaps he may benefit us, or we may adopt him as a son." And they perceived not.

source: وأصبح فؤاد أم موسى فارغا إن كادت لتبدي به لولا أن ربطنا على قلبها لتكون من المؤمنين
en: And the heart of Moses' mother became empty [of all else]. She was about to disclose [the matter concerning] him had We not bound fast her heart that she would be of the believers.

source: وقالت لأخته قصيه فبصرت به عن جنب وهم لا يشعرون
en: And she said to his sister, "Follow him"; so she watched him from a distance while they perceived not.

source: وحرمنا عليه المراضع من قبل فقالت هل أدلكم على أهل بيت يكفلونه لكم وهم له ناصحون
en: And We had prevented from him [all] wet nurses before, so she said, "Shall I direct you to a household that will be responsible for him for you while they are to him [for his upbringing] sincere?"

source: فرددناه إلى أمه كي تقر عينها ولا تحزن ولتعلم أن وعد الله حق ولكن أكثرهم لا يعلمون
en: So We restored him to his mother that she might be content and not grieve and that she would know that the promise of Allah is true. But most of the people do not know.

source: ولما بلغ أشده واستوى آتيناه حكما وعلما وكذلك نجزي المحسنين
en: And when he attained his full strength and was [mentally] mature, We bestowed upon him judgement and knowledge. And thus do We reward the doers of good.

source: ودخل المدينة على حين غفلة من أهلها فوجد فيها رجلين يقتتلان هذا من شيعته وهذا من عدوه فاستغاثه الذي من شيعته على الذي من عدوه فوكزه موسى فقضى عليه قال هذا من عمل الشيطان إنه عدو مضل مبين
en: And he entered the city at a time of inattention by its people and found therein two men fighting: one from his faction and one from among his enemy. And the one from his faction called for help to him against the one from his enemy, so Moses struck him and [unintentionally] killed him. [Moses] said, "This is from the work of Satan. Indeed, he is a manifest, misleading enemy."

source: قال رب إني ظلمت نفسي فاغفر لي فغفر له إنه هو الغفور الرحيم
en: He said, "My Lord, indeed I have wronged myself, so forgive me," and He forgave him. Indeed, He is the Forgiving, the Merciful.

source: قال رب بما أنعمت علي فلن أكون ظهيرا للمجرمين
en: He said, "My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals."

source: فأصبح في المدينة خائفا يترقب فإذا الذي استنصره بالأمس يستصرخه قال له موسى إنك لغوي مبين
en: And he became inside the city fearful and anticipating [exposure], when suddenly the one who sought his help the previous day cried out to him [once again]. Moses said to him, "Indeed, you are an evident, [persistent] deviator."

source: فلما أن أراد أن يبطش بالذي هو عدو لهما قال يا موسى أتريد أن تقتلني كما قتلت نفسا بالأمس إن تريد إلا أن تكون جبارا في الأرض وما تريد أن تكون من المصلحين
en: And when he wanted to strike the one who was an enemy to both of them, he said, "O Moses, do you intend to kill me as you killed someone yesterday? You only want to be a tyrant in the land and do not want to be of the amenders."

source: وجاء رجل من أقصى المدينة يسعى قال يا موسى إن الملأ يأتمرون بك ليقتلوك فاخرج إني لك من الناصحين
en: And a man came from the farthest end of the city, running. He said, "O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors."

source: فخرج منها خائفا يترقب قال رب نجني من القوم الظالمين
en: So he left it, fearful and anticipating [apprehension]. He said, "My Lord, save me from the wrongdoing people."

source: ولما توجه تلقاء مدين قال عسى ربي أن يهديني سواء السبيل
en: And when he directed himself toward Madyan, he said, "Perhaps my Lord will guide me to the sound way."

source: ولما ورد ماء مدين وجد عليه أمة من الناس يسقون ووجد من دونهم امرأتين تذودان قال ما خطبكما قالتا لا نسقي حتى يصدر الرعاء وأبونا شيخ كبير
en: And when he came to the well of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women driving back [their flocks]. He said, "What is your circumstance?" They said, "We do not water until the shepherds dispatch [their flocks]; and our father is an old man."

source: فسقى لهما ثم تولى إلى الظل فقال رب إني لما أنزلت إلي من خير فقير
en: So he watered [their flocks] for them; then he went back to the shade and said, "My Lord, indeed I am, for whatever good You would send down to me, in need."
